#Python, начало
# 1. Переменные
# нижеприведены примеры переменных разных типов и как их объявлять

# Целочисленные переменные (целые числа)
int_variable = 5 
# Переменные с плавающей точкой (десятичные числа)
float_variable = 5.5
# Строковые переменные (строки)
string_variable = "Hello, World!"
# булевские переменные (True/False)
bool_variable = True 
# Списки (массивы)
list_variable = [1, 2, 3, 4, 5]
# Словари (ассоциативные массивы)
dict_variable = {"key1": "value1", "key2": "value2", "key3": "value3"}
# Кортежи (неизменяемые списки)
tuple_variable = (1, 2, 3, 4, 5)
# Множества (неупорядоченные коллекции уникальных элементов)
set_variable = {1, 2, 3, 4, 5}
# пустые переменные (None)
none_variable = None
# название переменной чувствительны к регистру
Name = "Jonh"
name = "Jonh2"
# переменные могут содержать буквы, цифры и символы нижнего подчеркивания
# переменные не могут начинаться с цифры
# переменные не могут содержать пробелы
