# Множества (set) - это неупорядоченные коллекции уникальных объектов.
# Они могут содержать элементы различных типов, 
# включая числа, строки и другие множества.
# Множества полезны для удаления дубликатов из последовательностей,
# а также для выполнения математических операций, 
# таких как объединение, пересечение и разность.

nums = {1, 2, 3}
empty = set()         # ❗ Не {} — это словарь!
duplicates = {1, 2, 2, 3}  # {1, 2, 3}


# None напоследок
# None - это специальный объект в Python, 
# который представляет отсутствие значения или пустоту.

result = None
user = None
